#создание векторов
my_number <- 1:20
#обращение к произвольным индексам 
my_number2 <- my_number[c(2,5,7,9,12,16,20)]
# несколько векторов в одном
the_best_vector <- c(1:5000,7000:10000)
# Маппинг элементов векторов
my_number3 <- my_number+1
# четные числа из вектора
my_number3[my_number3%%2==0]
#произведение элементов меньше 10
my_sum <- prod(my_number[my_number<10])
# листы
a1 <- 1:5
a2<-5:1
a3 <- c(F,F,T,F,F)
# соединение листов(в матрицу)
data<-list(a1,a2,a3)
# создание представления
f <- data.frame(
  Direct=a1,Reverse=a2,Equal=a3)
#Запуск обзорщика View(f)

# отбросить элементы не превышающие дисперсию относительно среднего значения
my_vector <- c(21, 18, 21, 19, 25, 20, 17, 17, 18, 22, 17, 18, 18, 19, 19, 27, 21, 20, 24, 17, 15, 24, 24, 29, 19, 14, 21, 17, 19, 18, 18, 20, 21, 21, 19, 19, 17, 21, 13, 17, 13, 23, 15, 23, 24, 16, 17, 25, 24, 22)
my_vector_2 <- my_vector[abs(mean(my_vector)-my_vector)<sd(my_vector)] 
